package org.transaction;


// TODO: Програма для обробки банківських транзакцій.
//  Опишіть у чотирьох вищенаведених форматах дані:
//  список банківських транзакцій з параметрами
//  номер картки відправника,
//  номер картки отримувача,
//  сума,
//  валюта,
//  дата і час операції,
//  призначення платежу,
//  статус платежу.
//  Програма повинна запитувати на старті у користувача шлях до файлу з транзакціями.
//  По розширенню файла (.xml, .csv, .json, .yaml), визначте яким чином його зчитувати.
//  Зчитайте файл і надрукуйте список транзакцій.
//  Дайте можливість редагувати транзакції.
//  Перед завершенням роботи програми, не забудьте зберегти результат у файл(можна у новий).
//  Не забувайте про ООП, обробку помилок, логування.
//  Програма повинна збиратися в jar з усіма ресурсами (logback config).
//  Коректно працювати через java -jar запуск, не тільки з ідеї.
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}